app/controllers/pins_controller.rb

  def show
    @pins = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 1]]